Ran Plan for dir: `spanner-instance` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_firewall.allow-ssh will be created
+ resource "google_compute_firewall" "allow-ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh"
      + network            = "my-vpc-network"
      + priority           = 1000
      + project            = "onkar-17-cloud"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.vm_instance will be created
+ resource "google_compute_instance" "vm_instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = (known after apply)
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "example-instance"
      + project              = "onkar-17-cloud"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = (known after apply)
      + zone                 = "us-central1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-9"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # google_compute_network.vpc_network will be created
+ resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "my-vpc-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "onkar-17-cloud"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.cloud_spanner["test-instance"].google_spanner_instance.instance_processing_units[0] will be created
+ resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner demo"
      + effective_labels = {
          + "env" = "demo"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "demo"
        }
      + name             = "test-instance"
      + num_nodes        = (known after apply)
      + processing_units = 100
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "demo"
        }
    }

  # module.cloud_spanner["test-instance"].google_spanner_instance_iam_member.instance["user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin"] will be created
+ resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance"
      + member   = "user:onkar.naik@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance.instance_processing_units[0] will be created
+ resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-east4"
      + display_name     = "Spanner Prod"
      + effective_labels = {
          + "env" = "prod"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "prod"
        }
      + name             = "test-instance-2"
      + num_nodes        = (known after apply)
      + processing_units = 300
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "prod"
        }
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance_iam_member.instance["user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin"] will be created
+ resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance-2"
      + member   = "user:onkar.naik@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ spanner_instance_details = {
      + test-instance   = {
          + spanner_instance_iam_details = {
              + "user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance"
                  + member    = "user:onkar.naik@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
      + test-instance-2 = {
          + spanner_instance_iam_details = {
              + "user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance-2"
                  + member    = "user:onkar.naik@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
    }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d spanner-instance
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Onkar179%252Fterraform-sample-repo%252Fspanner-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d spanner-instance
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```